<template>
  <!-- 大数据工具 -->
  <div style="height: 100%">
    <IptComp
      ref="iptcomp"
      :toolType="toolType"
      :sheetName="sheetName"
      :excelOptions="excelOptions"
    ></IptComp>
  </div>
</template>

<script>
import IptComp from "@/components/iptTable/index.vue";
export default {
  name: "BigData",
  components: {
    IptComp,
  },
  data() {
    return {
      toolType: "0",
    };
  },
  watch: {
    $route: {
      handler(newval, oldval) {
        const vm = this;
        switch (newval.name) {
          // 计算
          case "Number":
            vm.toolType = "数坊人群计算";
            vm.sheetName = "Sheet1";
            vm.excelOptions = [
              {
                name: "Sheet1", //工作表名称
                color: "", //工作表颜色
                index: "renqun", //工作表索引
                status: 1, //激活状态
                hide: 0, //是否隐藏
                row: 1000, //行数
                column: 15, //列数
                defaultRowHeight: 40, //自定义行高
                defaultColWidth: 150, //自定义列宽
                celldata: [
                  // 通用区域
                  {
                    r: 0,
                    c: 1,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "通用区域", // 显示值
                      v: "通用区域", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                      bg: "red",
                    },
                  },
                  // 4A分布
                  {
                    r: 0,
                    c: 6,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "4A分布", // 显示值
                      v: "4A分布", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 浏览行为/加购行为/关注行为/购买行为
                  {
                    r: 0,
                    c: 10,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "浏览行为/加购行为/关注行为/购买行为", // 显示值
                      v: "浏览行为/加购行为/关注行为/购买行为", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 广告行为
                  {
                    r: 0,
                    c: 24,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "广告行为", // 显示值
                      v: "广告行为", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 推荐
                  {
                    r: 0,
                    c: 30,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "推荐", // 显示值
                      v: "推荐", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 秒杀
                  {
                    r: 0,
                    c: 38,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "秒杀", // 显示值
                      v: "秒杀", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 通天塔
                  {
                    r: 0,
                    c: 47,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "通天塔", // 显示值
                      v: "通天塔", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 十大靶群
                  {
                    r: 0,
                    c: 57,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "十大靶群", // 显示值
                      v: "十大靶群", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 性别
                  {
                    r: 0,
                    c: 58,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "性别", // 显示值
                      v: "性别", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 已有人群
                  {
                    r: 0,
                    c: 59,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "已有人群", // 显示值
                      v: "已有人群", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 搜索行为
                  {
                    r: 0,
                    c: 61,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "搜索行为", // 显示值
                      v: "搜索行为", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 数据类型选择
                  {
                    r: 1,
                    c: 0,
                    v: {
                      ct: { fa: "@", t: "s" }, // 格式类型
                      m: "数据类型选择", // 显示值
                      v: "数据类型选择", // 原始值
                      bl: 1,
                      tb: 2,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 仅保留京东pin
                  {
                    r: 1,
                    c: 1,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "仅保留京东pin",
                      v: "仅保留京东pin",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                      ps: {
                        //批注
                        width: 91, //批注框宽度
                        height: 48, //批注框高度
                        value:
                          "填写数据类型：保留京东PIN+设备号  仅保留京东PI   二选一", //批准内容
                        isshow: false, //批注框为显示状态
                      },
                    },
                  },
                  // 人群名
                  {
                    r: 2,
                    c: 0,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "人群名",
                      v: "人群名",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 标签名（单选）
                  {
                    r: 2,
                    c: 1,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "标签名（单选）",
                      v: "标签名（单选）",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 交-并-差
                  {
                    r: 2,
                    c: 2,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "交-并-差",
                      v: "交-并-差",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                      ps: {
                        //批注
                        width: 91, //批注框宽度
                        height: 48, //批注框高度
                        value:
                          "同一类人群名，第一行不填，后面的需单选一个合并方式（交集，并集，差集）", //批准内容
                        isshow: false, //批注框为显示状态
                      },
                    },
                  },
                  // 是否拓展为规则框
                  {
                    r: 2,
                    c: 3,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "是否拓展为规则框",
                      v: "是否拓展为规则框",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                      ps: {
                        //批注
                        width: 91, //批注框宽度
                        height: 48, //批注框高度
                        value:
                          "lizhenting:必填项，同一规则框，同一个命名。第一个是所在行的链接方式，代表整个规则框的链接方式。例如：规则框一、规则框二。不是规则框填“否”", //批准内容
                        isshow: false, //批注框为显示状态
                      },
                    },
                  },
                  // 时间类型
                  {
                    r: 2,
                    c: 4,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "时间类型",
                      v: "时间类型",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 时间
                  {
                    r: 2,
                    c: 5,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "时间",
                      v: "时间",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 4A模型类型
                  {
                    r: 2,
                    c: 6,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "4A模型类型",
                      v: "4A模型类型",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 4A模型
                  {
                    r: 2,
                    c: 7,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "4A模型",
                      v: "4A模型",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 类目
                  {
                    r: 2,
                    c: 8,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "类目",
                      v: "类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 状态
                  {
                    r: 2,
                    c: 9,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "状态",
                      v: "状态",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 维度筛选
                  {
                    r: 2,
                    c: 10,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "维度筛选",
                      v: "维度筛选",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 固定维度
                  {
                    r: 2,
                    c: 11,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "固定维度",
                      v: "固定维度",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 品牌
                  {
                    r: 2,
                    c: 12,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "品牌",
                      v: "品牌",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 品牌
                  {
                    r: 2,
                    c: 13,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "品牌",
                      v: "品牌",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 关键词
                  {
                    r: 2,
                    c: 14,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "关键词",
                      v: "关键词",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 类目
                  {
                    r: 2,
                    c: 15,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "类目",
                      v: "类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 三级类目
                  {
                    r: 2,
                    c: 16,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "三级类目",
                      v: "三级类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 店铺
                  {
                    r: 2,
                    c: 17,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "店铺",
                      v: "店铺",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // SKU ID
                  {
                    r: 2,
                    c: 18,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "SKU ID",
                      v: "SKU ID",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 试用商品
                  {
                    r: 2,
                    c: 19,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "试用商品",
                      v: "试用商品",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 商品标签
                  {
                    r: 2,
                    c: 20,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "商品标签",
                      v: "商品标签",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 经营模式
                  {
                    r: 2,
                    c: 21,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "经营模式",
                      v: "经营模式",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 频次
                  {
                    r: 2,
                    c: 22,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "频次",
                      v: "频次",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 价格
                  {
                    r: 2,
                    c: 23,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "价格",
                      v: "价格",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 新/老客
                  {
                    r: 2,
                    c: 24,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "新/老客",
                      v: "新/老客",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 产品线
                  {
                    r: 2,
                    c: 25,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "产品线",
                      v: "产品线",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 行为类型
                  {
                    r: 2,
                    c: 26,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "行为类型",
                      v: "行为类型",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 固定维度
                  {
                    r: 2,
                    c: 27,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "固定维度",
                      v: "固定维度",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 品牌
                  {
                    r: 2,
                    c: 28,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "品牌",
                      v: "品牌",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 类目
                  {
                    r: 2,
                    c: 29,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "类目",
                      v: "类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 三级类目
                  {
                    r: 2,
                    c: 30,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "三级类目",
                      v: "三级类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 店铺
                  {
                    r: 2,
                    c: 31,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "店铺",
                      v: "店铺",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // SKU ID
                  {
                    r: 2,
                    c: 32,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "SKU ID",
                      v: "SKU ID",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 频次
                  {
                    r: 2,
                    c: 33,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "频次",
                      v: "频次",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 分类类型
                  {
                    r: 2,
                    c: 34,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "分类类型",
                      v: "分类类型",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 行为类型
                  {
                    r: 2,
                    c: 35,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "行为类型",
                      v: "行为类型",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 固定维度
                  {
                    r: 2,
                    c: 36,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "固定维度",
                      v: "固定维度",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 品牌
                  {
                    r: 2,
                    c: 37,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "品牌",
                      v: "品牌",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 类目
                  {
                    r: 2,
                    c: 38,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "类目",
                      v: "类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 三级类目
                  {
                    r: 2,
                    c: 39,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "三级类目",
                      v: "三级类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 店铺
                  {
                    r: 2,
                    c: 40,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "店铺",
                      v: "店铺",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // SKU ID
                  {
                    r: 2,
                    c: 41,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "SKU ID",
                      v: "SKU ID",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 频次
                  {
                    r: 2,
                    c: 42,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "频次",
                      v: "频次",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 分类
                  {
                    r: 2,
                    c: 43,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "分类",
                      v: "分类",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 频道
                  {
                    r: 2,
                    c: 44,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "频道",
                      v: "频道",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 行为类型
                  {
                    r: 2,
                    c: 45,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "行为类型",
                      v: "行为类型",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 固定维度
                  {
                    r: 2,
                    c: 46,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "固定维度",
                      v: "固定维度",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 品牌
                  {
                    r: 2,
                    c: 47,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "品牌",
                      v: "品牌",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 类目
                  {
                    r: 2,
                    c: 48,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "类目",
                      v: "类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 三级类目
                  {
                    r: 2,
                    c: 49,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "三级类目",
                      v: "三级类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  }, // 店铺
                  {
                    r: 2,
                    c: 50,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "店铺",
                      v: "店铺",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // SKU ID
                  {
                    r: 2,
                    c: 51,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "SKU ID",
                      v: "SKU ID",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 频次
                  {
                    r: 2,
                    c: 52,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "频次",
                      v: "频次",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 十大靶群
                  {
                    r: 2,
                    c: 53,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "十大靶群",
                      v: "十大靶群",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 性别
                  {
                    r: 2,
                    c: 54,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "性别",
                      v: "性别",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 人群类型
                  {
                    r: 2,
                    c: 55,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "人群类型",
                      v: "人群类型",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 人群名称
                  {
                    r: 2,
                    c: 56,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "人群名称",
                      v: "人群名称",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 维度筛选
                  {
                    r: 2,
                    c: 57,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "维度筛选",
                      v: "维度筛选",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 固定维度
                  {
                    r: 2,
                    c: 58,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "固定维度",
                      v: "固定维度",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 品牌
                  {
                    r: 2,
                    c: 59,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "品牌",
                      v: "品牌",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 类目
                  {
                    r: 2,
                    c: 60,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "类目",
                      v: "类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 三级类目
                  {
                    r: 2,
                    c: 61,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "三级类目",
                      v: "三级类目",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 店铺
                  {
                    r: 2,
                    c: 62,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "店铺",
                      v: "店铺",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 关键词
                  {
                    r: 2,
                    c: 63,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "关键词",
                      v: "关键词",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // SKU ID
                  {
                    r: 2,
                    c: 64,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "SKU ID",
                      v: "SKU ID",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 商品标签
                  {
                    r: 2,
                    c: 65,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "商品标签",
                      v: "商品标签",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 频次
                  {
                    r: 2,
                    c: 66,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "频次",
                      v: "频次",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                  // 价格
                  {
                    r: 2,
                    c: 67,
                    v: {
                      ct: { fa: "@", t: "s" },
                      m: "价格",
                      v: "价格",
                      bl: 1,
                      vt: 0,
                      ht: 0,
                    },
                  },
                ], //初始化使用的单元格数据
                config: {
                  merge: {
                    "0_1": {
                      r: 0,
                      c: 1,
                      rs: 1,
                      cs: 5,
                    },
                    "0_6": {
                      r: 0,
                      c: 6,
                      rs: 1,
                      cs: 4,
                    },
                    "0_10": {
                      r: 0,
                      c: 10,
                      rs: 1,
                      cs: 14,
                    },
                    "0_24": {
                      r: 0,
                      c: 24,
                      rs: 1,
                      cs: 6,
                    },
                    "0_30": {
                      r: 0,
                      c: 30,
                      rs: 1,
                      cs: 8,
                    },
                    "0_38": {
                      r: 0,
                      c: 38,
                      rs: 1,
                      cs: 9,
                    },
                    "0_47": {
                      r: 0,
                      c: 47,
                      rs: 1,
                      cs: 10,
                    },
                    "0_59": {
                      r: 0,
                      c: 59,
                      rs: 1,
                      cs: 2,
                    },
                    "0_61": {
                      r: 0,
                      c: 61,
                      rs: 1,
                      cs: 11,
                    },
                  },
                },
                isPivotTable: false, //是否数据透视表
                zoomRatio: 1, // 缩放比例
                showGridLines: 1, //是否显示网格线
              },
            ];
            break;
          // 圈选
          case "Activity":
            this.toolType = "6";
            break;
          // 洞察分析
          case "Analysis":
            this.toolType = "7";
            break;
          // 透视分析
          case "Difference":
            this.toolType = "3";
            break;
          case "Population":
            this.toolType = "10";
            break;
        }
      },
      immediate: true,
      deep: true,
    },
  },
  methods: {},
  created() {},
};
</script>

<style lang="less" scoped>
</style>
