<template>
<!-- 大数据工具 -->
<div style="height: 100%">
  <IptComp ref="iptcomp" :formMenu="2" :picSrc="picSrc" :ifDown="ifDown" :colWidth="colWidth" :toolType="toolType" :sheetName="sheetName" :excelOptions="excelOptions"></IptComp>
</div>
</template>

<script>
import IptComp from "@/components/iptTable/index.vue";
export default {
  name: "BigData",
  components: {
    IptComp,
  },
  data() {
    return {
      toolType: "0",
      ifDown: true
    };
  },
  watch: {
    $route: {
      handler(newval, oldval) {
        const vm = this;
        vm.colWidth = {
          user: 24,
          cookie: 24,
        }
        let opt = [{
          name: "Sheet1", //工作表名称
          color: "", //工作表颜色
          index: "renqun", //工作表索引
          status: 1, //激活状态
          hide: 0, //是否隐藏
          row: 1000, //行数
          column: 15, //列数
          defaultRowHeight: 40, //自定义行高
          defaultColWidth: 150, //自定义列宽
          celldata: [{
              r: 0,
              c: 0,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#FDEBDD",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 通用区域
            {
              r: 0,
              c: 1,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "通用区域", // 显示值
                v: "通用区域", // 原始值
                bg: "#FDEBDD",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 4A分布
            {
              r: 0,
              c: 6,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "4A分布", // 显示值
                v: "4A分布", // 原始值
                bg: "#DEF0F4",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 浏览行为/加购行为/关注行为/购买行为
            {
              r: 0,
              c: 10,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "浏览行为/加购行为/关注行为/购买行为", // 显示值
                v: "浏览行为/加购行为/关注行为/购买行为", // 原始值
                bg: "#F7F4D7",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 广告行为
            {
              r: 0,
              c: 24,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "广告行为", // 显示值
                v: "广告行为", // 原始值
                bg: "#F3E0DF",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 推荐
            {
              r: 0,
              c: 30,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "推荐", // 显示值
                v: "推荐", // 原始值
                bg: "#EDF3E2",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 秒杀
            {
              r: 0,
              c: 38,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "秒杀", // 显示值
                v: "秒杀", // 原始值
                bg: "#E7E2EE",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 通天塔
            {
              r: 0,
              c: 47,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "通天塔", // 显示值
                v: "通天塔", // 原始值
                bg: "#DEF0F4",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 十大靶群
            {
              r: 0,
              c: 57,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "十大靶群", // 显示值
                v: "十大靶群", // 原始值
                bg: "#B3B0B8",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 性别
            {
              r: 0,
              c: 58,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "性别", // 显示值
                v: "性别", // 原始值
                bg: "#D1CED8",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 已有人群
            {
              r: 0,
              c: 59,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "已有人群", // 显示值
                v: "已有人群", // 原始值
                bg: "#F3E0DF",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 搜索行为
            {
              r: 0,
              c: 61,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "搜索行为", // 显示值
                v: "搜索行为", // 原始值
                bg: "#D1C6DE",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 数据类型选择
            {
              r: 1,
              c: 0,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "数据类型选择", // 显示值
                v: "数据类型选择", // 原始值
                bg: "#FDEBDD",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            },
            // 仅保留京东pin
            {
              r: 1,
              c: 1,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "仅保留京东PIN",
                v: "仅保留京东PIN",
                bg: "#FDEBDD",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "填写数据类型：保留京东PIN+设备号  仅保留京东PI   二选一", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 人群名
            {
              r: 2,
              c: 0,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "人群名",
                v: "人群名",
                bg: "#FDEBDD",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "自定义命名，如该人群包含多个标签，可填写多行。", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 通用区域-------------------
            // 标签名（单选）
            {
              r: 2,
              c: 1,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "标签名（单选）",
                v: "标签名（单选）",
                bg: "#FDEBDD",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 交-并-差
            {
              r: 2,
              c: 2,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "交-并-差",
                v: "交-并-差",
                bg: "#FDEBDD",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "同一类人群名，第一行不填，后面的需单选一个合并方式（交集，并集，差集）", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 是否拓展为规则框
            {
              r: 2,
              c: 3,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "是否拓展为规则框",
                v: "是否拓展为规则框",
                bg: "#FDEBDD",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "lizhenting:必填项，同一规则框，同一个命名。第一个是所在行的链接方式，代表整个规则框的链接方式。例如：规则框一、规则框二。不是规则框填“否”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 时间类型
            {
              r: 2,
              c: 4,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "时间类型",
                v: "时间类型",
                bg: "#FDEBDD",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 时间
            {
              r: 2,
              c: 5,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "时间",
                v: "时间",
                bg: "#FDEBDD",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "填写规范：如果选择固定时间，直接填数字即可；如果选择自定义，填写格式（2022-01-14至2022-02-14）", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 4A分布----------------------
            // 4A模型类型
            {
              r: 2,
              c: 6,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "4A模型类型",
                v: "4A模型类型",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 4A模型
            {
              r: 2,
              c: 7,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "4A模型",
                v: "4A模型",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 类目
            {
              r: 2,
              c: 8,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "类目",
                v: "类目",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 状态
            {
              r: 2,
              c: 9,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "状态",
                v: "状态",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "如有多个状态，用“*”号隔开。例如“认知*吸引”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 浏览行为/加购行为/关注行为/购买行为------------
            // 维度筛选
            {
              r: 2,
              c: 10,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "维度筛选",
                v: "维度筛选",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:全部or支持规则同步", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 固定维度
            {
              r: 2,
              c: 11,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "固定维度",
                v: "固定维度",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "根据选择的维度，在后四列中选择对应的列进行填写。", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 品牌
            {
              r: 2,
              c: 12,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "品牌",
                v: "品牌",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:填写需要和数坊平台显示的品牌名称一致", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 关键词
            {
              r: 2,
              c: 13,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "关键词",
                v: "关键词",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:多个关键词以“*”分隔", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 类目
            {
              r: 2,
              c: 14,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "类目",
                v: "类目",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "用“>”符号表示层级关系，例如：“母婴>尿裤>婴童纸尿裤”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 三级类目
            {
              r: 2,
              c: 15,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "三级类目",
                v: "三级类目",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "用“>”符号表示层级关系，例如：“母婴>尿裤>婴童纸尿裤”’多个类目用“*”号隔开", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 店铺
            {
              r: 2,
              c: 16,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "店铺",
                v: "店铺",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // SKU ID
            {
              r: 2,
              c: 17,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "SKU ID",
                v: "SKU ID",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:多个SKU用“*”隔开，", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 试用商品
            {
              r: 2,
              c: 18,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "试用商品",
                v: "试用商品",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:试用商品：包括试用商品、不包括试用商品（后者不支持人群计算）", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 商品标签
            {
              r: 2,
              c: 19,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "商品标签",
                v: "商品标签",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:多个商品标签用“*”隔开", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 经营模式
            {
              r: 2,
              c: 20,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "经营模式",
                v: "经营模式",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:经营模式：全部、自营、POP（关注行为无该选项），自营和POP不支持实时计算", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 频次
            {
              r: 2,
              c: 21,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "频次",
                v: "频次",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "如选择不限：直接填写“不限”；如选择范围，填写格式如：“0至28”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 价格
            {
              r: 2,
              c: 22,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "价格",
                v: "价格",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "如选择不限：直接填写“不限”；如选择范围，填写格式如：“0至28”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 新/老客
            {
              r: 2,
              c: 23,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "新/老客",
                v: "新/老客",
                bg: "#F7F4D7",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 广告行为--------------------
            // 产品线
            {
              r: 2,
              c: 24,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "产品线",
                v: "产品线",
                bg: "#F3E0DF",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "可填写多个，多个请用“*”隔开，例如：“京东快车-普通计划*京东快车-秒杀计划”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 行为类型
            {
              r: 2,
              c: 25,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "行为类型",
                v: "行为类型",
                bg: "#F3E0DF",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:曝光、点击", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 固定维度
            {
              r: 2,
              c: 26,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "固定维度",
                v: "固定维度",
                bg: "#F3E0DF",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 品牌
            {
              r: 2,
              c: 27,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "品牌",
                v: "品牌",
                bg: "#F3E0DF",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 三级类目
            {
              r: 2,
              c: 28,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "三级类目",
                v: "三级类目",
                bg: "#F3E0DF",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "用“>”符号表示层级关系，例如：“母婴>尿裤>婴童纸尿裤”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 频次
            {
              r: 2,
              c: 29,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "频次",
                v: "频次",
                bg: "#F3E0DF",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "如选择不限：直接填写“不限”；如选择范围，填写格式如：“0至28”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 推荐 ----------------
            // 行为类型
            {
              r: 2,
              c: 30,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "行为类型",
                v: "行为类型",
                bg: "#EDF3E2",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 固定维度
            {
              r: 2,
              c: 31,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "固定维度",
                v: "固定维度",
                bg: "#EDF3E2",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 品牌
            {
              r: 2,
              c: 32,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "品牌",
                v: "品牌",
                bg: "#EDF3E2",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 类目
            {
              r: 2,
              c: 33,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "类目",
                v: "类目",
                bg: "#EDF3E2",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "用“>”符号表示层级关系，例如：“母婴>尿裤>婴童纸尿裤”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 三级类目
            {
              r: 2,
              c: 34,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "三级类目",
                v: "三级类目",
                bg: "#EDF3E2",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "用“>”符号表示层级关系，例如：“母婴>尿裤>婴童纸尿裤”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 店铺
            {
              r: 2,
              c: 35,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "店铺",
                v: "店铺",
                bg: "#EDF3E2",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // SKU ID
            {
              r: 2,
              c: 36,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "SKU ID",
                v: "SKU ID",
                bg: "#EDF3E2",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 频次
            {
              r: 2,
              c: 37,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "频次",
                v: "频次",
                bg: "#EDF3E2",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "如选择不限：直接填写“不限”；如选择范围，填写格式如：“0至28”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 秒杀-----------
            // 分类类型
            {
              r: 2,
              c: 38,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "分类类型",
                v: "分类类型",
                bg: "#E7E2EE",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:京东秒杀、品牌闪购、每日特价", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 行为类型
            {
              r: 2,
              c: 39,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "行为类型",
                v: "行为类型",
                bg: "#E7E2EE",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:行为类型行为类型：浏览、点击", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 固定维度
            {
              r: 2,
              c: 40,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "固定维度",
                v: "固定维度",
                bg: "#E7E2EE",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:SKU、品牌整体、品牌X三级类目、类目、店铺内商品", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 品牌
            {
              r: 2,
              c: 41,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "品牌",
                v: "品牌",
                bg: "#E7E2EE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 类目
            {
              r: 2,
              c: 42,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "类目",
                v: "类目",
                bg: "#E7E2EE",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "用“>”符号表示层级关系，例如：“母婴>尿裤>婴童纸尿裤”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 三级类目
            {
              r: 2,
              c: 43,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "三级类目",
                v: "三级类目",
                bg: "#E7E2EE",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "用“>”符号表示层级关系，例如：“母婴>尿裤>婴童纸尿裤”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 店铺
            {
              r: 2,
              c: 44,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "店铺",
                v: "店铺",
                bg: "#E7E2EE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // SKU ID
            {
              r: 2,
              c: 45,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "SKU ID",
                v: "SKU ID",
                bg: "#E7E2EE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 频次
            {
              r: 2,
              c: 46,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "频次",
                v: "频次",
                bg: "#E7E2EE",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "如选择不限：直接填写“不限”；如选择范围，填写格式如：“0至28”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 通天塔-------------
            // 分类
            {
              r: 2,
              c: 47,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "分类",
                v: "分类",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:分类：活动、类目频道", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 频道
            {
              r: 2,
              c: 48,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "频道",
                v: "频道",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:频道：数码电器、酷玩科技、新京曝、玩3C、京东家电、手机馆、电脑馆、数码馆、新机首发、窝者家居、京东服饰、咔嚓晒图、潮流服饰&女生衣橱。", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 行为类型
            {
              r: 2,
              c: 49,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "行为类型",
                v: "行为类型",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:行为类型：曝光、点击。", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 固定维度
            {
              r: 2,
              c: 50,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "固定维度",
                v: "固定维度",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:固定维度：SKU、品牌整体、品牌X三级类目、类目、店铺内商品。", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 品牌
            {
              r: 2,
              c: 51,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "品牌",
                v: "品牌",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 类目
            {
              r: 2,
              c: 52,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "类目",
                v: "类目",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "用“>”符号表示层级关系，例如：“母婴>尿裤>婴童纸尿裤”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 三级类目
            {
              r: 2,
              c: 53,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "三级类目",
                v: "三级类目",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "用“>”符号表示层级关系，例如：“母婴>尿裤>婴童纸尿裤”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 店铺
            {
              r: 2,
              c: 54,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "店铺",
                v: "店铺",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // SKU ID
            {
              r: 2,
              c: 55,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "SKU ID",
                v: "SKU ID",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 频次
            {
              r: 2,
              c: 56,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "频次",
                v: "频次",
                bg: "#DEF0F4",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "如选择不限：直接填写“不限”；如选择范围，填写格式如：“0至28”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 十大靶群
            {
              r: 2,
              c: 57,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "十大靶群",
                v: "十大靶群",
                bg: "#B3B0B8",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "可多选，多个内容请用“*”隔开，例如：“学生一族*小镇青年”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 性别
            {
              r: 2,
              c: 58,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "性别",
                v: "性别",
                bg: "#D1CED8",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "可多选，多个内容请用“*”隔开，例如：“女*男”", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 人群类型
            {
              r: 2,
              c: 59,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "人群类型",
                v: "人群类型",
                bg: "#F3E0DF",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:人群类型：全部、自定义人群、快捷人群、洞察分析人群、营销活动人群、耐消品模型人群、配置人群、第一方人群。", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 人群名称
            {
              r: 2,
              c: 60,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "人群名称",
                v: "人群名称",
                bg: "#F3E0DF",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 搜索行为----------
            // 维度筛选
            {
              r: 2,
              c: 61,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "维度筛选",
                v: "维度筛选",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 固定维度
            {
              r: 2,
              c: 62,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "固定维度",
                v: "固定维度",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
                ps: {
                  //批注
                  width: 91, //批注框宽度
                  height: 48, //批注框高度
                  value: "Tkey78:SKU（搜索点击），品牌整体（搜索曝光）、品牌X三级类目（搜索点击）、类目（搜索点击）、搜索关键词、搜索三级类目（通过模型计算高相关三级类目）、类目X商品标签（搜索点击）。", //批准内容
                  isshow: false, //批注框为显示状态
                },
              },
            },
            // 品牌
            {
              r: 2,
              c: 63,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "品牌",
                v: "品牌",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 类目
            {
              r: 2,
              c: 64,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "类目",
                v: "类目",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 三级类目
            {
              r: 2,
              c: 65,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "三级类目",
                v: "三级类目",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 店铺
            {
              r: 2,
              c: 66,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "店铺",
                v: "店铺",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 关键词
            {
              r: 2,
              c: 67,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "关键词",
                v: "关键词",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // SKU ID
            {
              r: 2,
              c: 68,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "SKU ID",
                v: "SKU ID",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 商品标签
            {
              r: 2,
              c: 69,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "商品标签",
                v: "商品标签",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 频次
            {
              r: 2,
              c: 70,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "频次",
                v: "频次",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
            // 价格
            {
              r: 2,
              c: 71,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                },
                m: "价格",
                v: "价格",
                bg: "#D1C6DE",
                bl: 1,
                vt: 0,
                ht: 0,
              },
            },
          ], //初始化使用的单元格数据
          config: {
            merge: {
              "0_1": {
                r: 0,
                c: 1,
                rs: 1,
                cs: 5,
              },
              "0_6": {
                r: 0,
                c: 6,
                rs: 1,
                cs: 4,
              },
              "0_10": {
                r: 0,
                c: 10,
                rs: 1,
                cs: 14,
              },
              "0_24": {
                r: 0,
                c: 24,
                rs: 1,
                cs: 6,
              },
              "0_30": {
                r: 0,
                c: 30,
                rs: 1,
                cs: 8,
              },
              "0_38": {
                r: 0,
                c: 38,
                rs: 1,
                cs: 9,
              },
              "0_47": {
                r: 0,
                c: 47,
                rs: 1,
                cs: 10,
              },
              "0_59": {
                r: 0,
                c: 59,
                rs: 1,
                cs: 2,
              },
              "0_61": {
                r: 0,
                c: 61,
                rs: 1,
                cs: 11,
              },
            },
          },
          isPivotTable: false, //是否数据透视表
          zoomRatio: 1, // 缩放比例
          showGridLines: 1, //是否显示网格线
          dataVerification: {
            "1_1": {
              type: "dropdown",
              type2: null,
              value1: "仅保留京东PIN, 保留京东PIN + 设备号",
              value2: "",
              checked: false,
              remote: false,
              prohibitInput: true,
              hintShow: false,
            },
          },
        }, ];
        let arr = new Array(100).fill(1);
        arr.forEach((val, idx) => {
          if (idx >= 2 && idx <= 5) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#FDEBDD",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          } else if (idx >= 6 && idx <= 9) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#DEF0F4",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          } else if (idx >= 10 && idx <= 23) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#F7F4D7",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          } else if (idx >= 24 && idx <= 29) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#F3E0DF",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          } else if (idx >= 30 && idx <= 37) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#EDF3E2",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          } else if (idx >= 38 && idx <= 46) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#E7E2EE",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          } else if (idx >= 47 && idx <= 56) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#DEF0F4",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          } else if (idx === 57) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#B3B0B8",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          } else if (idx === 58) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#D1CED8",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          } else if (idx >= 59 && idx <= 60) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#F3E0DF",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          } else if (idx >= 61 && idx <= 71) {
            opt[0].celldata.push({
              r: 1,
              c: idx,
              v: {
                ct: {
                  fa: "@",
                  t: "s"
                }, // 格式类型
                m: "", // 显示值
                v: "", // 原始值
                bg: "#D1C6DE",
                bl: 1,
                tb: 2,
                vt: 0,
                ht: 0,
              },
            });
          }
        });
        switch (newval.name) {
          // 计算
          case "Caculate":
            vm.toolType = "数坊人群计算";
            vm.ifDown = true
            vm.picSrc = require("../../assets/images/人群计算.png");
            vm.sheetName = "Sheet1";
            vm.excelOptions = opt;
            break;
            // 圈选
          case "Select":
            vm.toolType = "数坊人群圈选";
            vm.picSrc = require("../../assets/images/人群圈选3.png");
            vm.ifDown = false
            vm.sheetName = "Sheet1";
            vm.excelOptions = opt;
            break;
            // 洞察分析
          case "Analysis":
            vm.toolType = "数坊洞察分析";
            vm.picSrc = require("../../assets/images/洞察分析2.png");
            vm.sheetName = "Sheet1";
            vm.ifDown = true
            vm.excelOptions = [{
              name: "Sheet1", //工作表名称
              color: "", //工作表颜色
              index: "renqun", //工作表索引
              status: 1, //激活状态
              hide: 0, //是否隐藏
              row: 1000, //行数
              column: 15, //列数
              defaultRowHeight: 40, //自定义行高
              defaultColWidth: 150, //自定义列宽
              celldata: [{
                r: 0,
                c: 0,
                v: {
                  ct: {
                    fa: "@",
                    t: "s"
                  }, // 格式类型
                  m: "分析名称", // 显示值
                  v: "分析名称", // 原始值
                  bl: 1,
                  tb: 2,
                  vt: 0,
                  ht: 0,
                },
              }, ], //初始化使用的单元格数据
              isPivotTable: false, //是否数据透视表
              zoomRatio: 1, // 缩放比例
              showGridLines: 1, //是否显示网格线
            }, ];
            break;
            // 透视分析
          case "Insight":
            vm.toolType = "数坊人群透视分析";
            vm.sheetName = "Sheet1";
            vm.picSrc = require("../../assets/images/透视分析2.png");
            vm.ifDown = true
            vm.excelOptions = [{
              name: "Sheet1", //工作表名称
              color: "", //工作表颜色
              index: "renqun", //工作表索引
              status: 1, //激活状态
              hide: 0, //是否隐藏
              row: 1000, //行数
              column: 15, //列数
              defaultRowHeight: 40, //自定义行高
              defaultColWidth: 150, //自定义列宽
              celldata: [{
                r: 0,
                c: 0,
                v: {
                  ct: {
                    fa: "@",
                    t: "s"
                  }, // 格式类型
                  m: "人群名", // 显示值
                  v: "人群名", // 原始值
                  bl: 1,
                  tb: 2,
                  vt: 0,
                  ht: 0,
                },
              }, ], //初始化使用的单元格数据
              isPivotTable: false, //是否数据透视表
              zoomRatio: 1, // 缩放比例
              showGridLines: 1, //是否显示网格线
            }, ];
            break;
            // 人群追踪
          case "Track":
            vm.toolType = "数坊营销人群追踪";
            vm.picSrc = require("../../assets/images/人群追踪3.png");
            vm.sheetName = "Sheet1";
            vm.ifDown = false
            vm.excelOptions = [{
              name: "Sheet1", //工作表名称
              color: "", //工作表颜色
              index: "renqun", //工作表索引
              status: 1, //激活状态
              hide: 0, //是否隐藏
              row: 1000, //行数
              column: 15, //列数
              defaultRowHeight: 40, //自定义行高
              defaultColWidth: 150, //自定义列宽
              celldata: [
                // 报告名称
                {
                  r: 0,
                  c: 0,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "报告名称", // 显示值
                    v: "报告名称", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                  },
                },
                // 投放/监测账号
                {
                  r: 0,
                  c: 1,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "投放/监测账号", // 显示值
                    v: "投放/监测账号", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                  },
                },
                // 投放/检测平台
                {
                  r: 0,
                  c: 2,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "投放/检测平台", // 显示值
                    v: "投放/检测平台", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                    ps: {
                      //批注
                      width: 91, //批注框宽度
                      height: 48, //批注框高度
                      value: "目前只支持京准通", //批准内容
                      isshow: false, //批注框为显示状态
                    },
                  },
                },
                // 活动类型
                {
                  r: 0,
                  c: 3,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "活动类型", // 显示值
                    v: "活动类型", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                    ps: {
                      //批注
                      width: 91, //批注框宽度
                      height: 48, //批注框高度
                      value: "支持的活动类型有:京东快车, 京东展位, 京东直投, 联合活动, 购物触点, 京东海投, 品牌广告", //批准内容
                      isshow: false, //批注框为显示状态
                    },
                  },
                },
                // 活动范围
                {
                  r: 0,
                  c: 4,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "活动范围", // 显示值
                    v: "活动范围", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                    ps: {
                      //批注
                      width: 91, //批注框宽度
                      height: 48, //批注框高度
                      value: "计划：1, 订单：1, 单元：2, 广告：2, 活动：3, 排期：4", //批准内容
                      isshow: false, //批注框为显示状态
                    },
                  },
                },
                // 活动范围名称
                {
                  r: 0,
                  c: 5,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "活动范围名称", // 显示值
                    v: "活动范围名称", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                    ps: {
                      //批注
                      width: 91, //批注框宽度
                      height: 48, //批注框高度
                      value: "单元、广告、排期时活动范围名称有两个，需要以‘/’来进行分隔", //批准内容
                      isshow: false, //批注框为显示状态
                    },
                  },
                },
                // 广告行为
                {
                  r: 0,
                  c: 6,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "广告行为", // 显示值
                    v: "广告行为", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                    ps: {
                      //批注
                      width: 91, //批注框宽度
                      height: 48, //批注框高度
                      value: "曝光:1, 广告:2", //批准内容
                      isshow: false, //批注框为显示状态
                    },
                  },
                },
                // 开始时间
                {
                  r: 0,
                  c: 7,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "开始时间", // 显示值
                    v: "开始时间", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                  },
                },
                // 结束时间
                {
                  r: 0,
                  c: 8,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "结束时间", // 显示值
                    v: "结束时间", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                  },
                },
                // 品牌
                {
                  r: 0,
                  c: 9,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "品牌", // 显示值
                    v: "品牌", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                  },
                },
                // 分类
                {
                  r: 0,
                  c: 10,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "分类", // 显示值
                    v: "分类", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                    ps: {
                      //批注
                      width: 91, //批注框宽度
                      height: 48, //批注框高度
                      value: "没有备注可以不用填写", //批准内容
                      isshow: false, //批注框为显示状态
                    },
                  },
                },
                // 报告终止时间
                {
                  r: 0,
                  c: 11,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "报告终止时间", // 显示值
                    v: "报告终止时间", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                  },
                },
              ], //初始化使用的单元格数据
              isPivotTable: false, //是否数据透视表
              zoomRatio: 1, // 缩放比例
              showGridLines: 1, //是否显示网格线
            }, ];
            break;
            // 人群报告
          case "Report":
            vm.toolType = "营销人群报告数据表";
            vm.sheetName = "Sheet1";
            vm.picSrc = require("../../assets/images/人群报告2.png");
            vm.ifDown = true
            vm.excelOptions = [{
              name: "Sheet1", //工作表名称
              color: "", //工作表颜色
              index: "renqun", //工作表索引
              status: 1, //激活状态
              hide: 0, //是否隐藏
              row: 1000, //行数
              column: 15, //列数
              defaultRowHeight: 40, //自定义行高
              defaultColWidth: 150, //自定义列宽
              celldata: [{
                  r: 0,
                  c: 0,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "报告名称", // 显示值
                    v: "报告名称", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                  },
                },
                {
                  r: 0,
                  c: 1,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "报告结束时间", // 显示值
                    v: "报告结束时间", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                  },
                },
                {
                  r: 0,
                  c: 2,
                  v: {
                    ct: {
                      fa: "@",
                      t: "s"
                    }, // 格式类型
                    m: "新老客口径", // 显示值
                    v: "新老客口径", // 原始值
                    bl: 1,
                    tb: 2,
                    vt: 0,
                    ht: 0,
                  },
                },
              ], //初始化使用的单元格数据
              isPivotTable: false, //是否数据透视表
              zoomRatio: 1, // 缩放比例
              showGridLines: 1, //是否显示网格线
            }, ];
            break;
        }
      },
      immediate: true,
      deep: true,
    },
  },
  methods: {},
  created() {},
};
</script>

<style lang="less" scoped>
</style>
